Конфигурация/DataProcessors/гкс_ПриемкаТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>гкс_ПриемкаТранспорта</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/Documents/гкс_РегистрацияНаПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>гкс_РегистрацияНаПЛК</Name>
			<BasedOn>
				<xr:Item>Document.гкс_ВъездНаКПП</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.гкс_СДИЗНаПЛК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПолучатель</Name>
					<Comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внутригрупповой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаВъезда</Name>
					<Comment>Точка маршрута для определения проезда</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ИДРейса</Name>
					<Comment>ERP-2176</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияВеса</Name>
					<Comment>Ед.измерения веса в документе</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗоныКарантинногоКонтроля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗоныКарантинногоКонтроляСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесоваяВъезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СтруктураПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПроезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УсловияПроезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СтруктураПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаОтгрузкуПродукции</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгрузкаСОдногоБорта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ВъездНаКПП</v8:Type>
						<v8:Type>cfg:DocumentRef.гкс_СРПВПрибытиеНаПуть</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СДИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СДИЗЗЕРНО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/DataProcessors/гкс_ПриемкаТранспорта/Forms/ФормаНастроекГрупповогоИзменения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазнаяНоменклатура		= Параметры.РазнаяНоменклатура;
	ЭтоКомандаНаРазгрузку	= Параметры.ЭтоКомандаНаРазгрузку;
	ВыбранныеРегистрации = Новый Структура("МассивРегистраций", Параметры.МассивРегистраций);
	
	УстановитьВидимостьДоступностьЭлементовФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспНоменклатураПриИзменении(Элемент)
	
	Если ИспНоменклатура Тогда
		Если РазнаяНоменклатура Тогда
			ТекстСообщения = НСтр("ru='В выбранных строках разная номенклатура! Не возможно изменить.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ИспНоменклатура = Ложь;
		Иначе
			Элементы.Номенклатура.ТолькоПросмотр = Ложь;
		КонецЕсли;
	Иначе
		Элементы.Номенклатура.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКачествоПриИзменении(Элемент)
	
	Элементы.ПринятьКачествоКомментарий.Доступность = ПринятьКачество;

КонецПроцедуры

&НаКлиенте
Процедура СлужебнаяНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание,
	СтандартнаяОбработка)
	ЭталоныКачества = ПолучитьВидНоменклатурыЭталоныКачества();

	Если ЗначениеЗаполнено(ЭталоныКачества) Тогда
		СтандартнаяОбработка = Ложь;

		ПарамерыВыбораМассив = Новый Массив;
		ПарамерыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.ВидНоменклатуры", ЭталоныКачества));
		ПарамерыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь));
		ПарамерыВыбораМассив.Добавить(Новый ПараметрВыбора("Отбор.ЭтоГруппа", Ложь));
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПарамерыВыбораМассив);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СлужебнаяНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	
	СтруктураОтбора = ПолучитьОтборНоменклатурыЭталоныКачества();
	Если СтруктураОтбора <> Неопределено И СтруктураОтбора.Количество() Тогда
		ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыОткрытия, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СлужебнаяНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением,
	СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если ПроверитьВыборНоменклатурыЭталоныКачества(ВыбранноеЗначение) Тогда
		СлужебнаяНоменклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		ТекстСообщения = НСтр("ru = 'У выбранного элемента справочника ""Номенклатура""'") + НСтр(
			"ru = ' вид номенклатуры должен быть ""Эталоны качества""'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	СлужебнаяНоменклатура = ВыбранноеЗначение;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьДанные(Команда)
	
	Если ЭтоКомандаНаРазгрузку Тогда
		
	Если ПринятьКачество И НЕ ЗначениеЗаполнено(ПринятьКачествоКомментарий) Тогда
		ТекстСообщения = НСтр("ru = 'При принятии качества необходимо заполнить комментарий'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ПринятьКачествоКомментарий");
		Возврат;
	КонецЕсли; 
			
		ПараметрыНаРазгрузку = Новый Структура;
		ПараметрыНаРазгрузку.Вставить("ПринятьКачество", 		ПринятьКачество);
		ПараметрыНаРазгрузку.Вставить("Комментарий", 			ПринятьКачествоКомментарий);
		ПараметрыНаРазгрузку.Вставить("Склад", 					Силос);
		ПараметрыНаРазгрузку.Вставить("ЯмаРазгрузки", 			МестоРазгрузки);
		ПараметрыНаРазгрузку.Вставить("СлужебнаяНоменклатура", 	СлужебнаяНоменклатура);
		
		Закрыть(ПараметрыНаРазгрузку);
	Иначе
		ОбработатьДанныеНаСервере();
		
		Если ЕстьИзмененные Тогда
			Оповестить("ГрупповаяОбработкаРегистраций");
		КонецЕсли;
		
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыход(Команда)
	
	Закрыть();

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьДанныеНаСервере()
	
	ЕстьИзмененные = Ложь;
	ИзменятьНоменклатуру 	= ИспНоменклатура И ЗначениеЗаполнено(Номенклатура);
	
	Если ИзменятьНоменклатуру Или ИспКомментарий Тогда
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ВыбранныеРегистрации", 	ВыбранныеРегистрации.МассивРегистраций);
		
		Если ИзменятьНоменклатуру Тогда
			ПараметрыЗаполнения.Вставить("Номенклатура", 		Номенклатура);
		КонецЕсли;
		Если ИспКомментарий Тогда
			ПараметрыЗаполнения.Вставить("Комментарий", 		Комментарий);
		КонецЕсли;
		
		Документы.гкс_РегистрацияНаПЛК.ГрупповоеИзменениеРегистрацийИзАРМ(ПараметрыЗаполнения);
		
		ЕстьИзмененные = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	
	Элементы.ИспНоменклатура.Видимость				= Не ЭтоКомандаНаРазгрузку;
	Элементы.ИспКомментарий.Видимость				= Не ЭтоКомандаНаРазгрузку;
	Элементы.Номенклатура.Видимость					= Не ЭтоКомандаНаРазгрузку;
	Элементы.Комментарий.Видимость					= Не ЭтоКомандаНаРазгрузку;
	Элементы.ПринятьКачество.Видимость				= ЭтоКомандаНаРазгрузку;
	Элементы.ПринятьКачествоКомментарий.Видимость	= ЭтоКомандаНаРазгрузку;
	Элементы.Силос.Видимость						= ЭтоКомандаНаРазгрузку;
	Элементы.МестоРазгрузки.Видимость				= ЭтоКомандаНаРазгрузку;
	Элементы.СлужебнаяНоменклатура.Видимость		= ЭтоКомандаНаРазгрузку;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОтборНоменклатурыЭталоныКачества()
	
	СтруктураОтбора = Новый Структура;
	ЭталоныКачества = ПолучитьВидНоменклатурыЭталоныКачества();
	
	Если ЗначениеЗаполнено(ЭталоныКачества) Тогда
		СтруктураОтбора.Вставить("ВидНоменклатуры", ЭталоныКачества);
		СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
		СтруктураОтбора.Вставить("ЭтоГруппа", Ложь);
	Иначе
		ТекстСообщения = НСтр("ru = 'Не найден вид номенклатуры ""Эталоны качества"".'")
			+ НСтр("ru = ' Отбор не применен.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат СтруктураОтбора;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьВыборНоменклатурыЭталоныКачества(ВыбранноеЗначение)
	
	ЭталоныКачества = ПолучитьВидНоменклатурыЭталоныКачества();
	Если Не ЗначениеЗаполнено(ЭталоныКачества) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитВидНоменклатуры = "ВидНоменклатуры";
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, РеквизитВидНоменклатуры);
	Возврат ВидНоменклатуры <> ЭталоныКачества;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВидНоменклатурыЭталоныКачества()
	
	Возврат гкс_ОбщегоНазначенияВызовСервера.ПроизвольныйПредопределенныйОбъект("ВидыНоменклатурыЭталоныКачества");
	
КонецФункции


#КонецОбласти
